/*=============================================================================

		タイトル[ title.cpp ]

-------------------------------------------------------------------------------

	■　作成日
		2016/12/15
-------------------------------------------------------------------------------
	■　Update
=============================================================================*/
/*-----------------------------------------------------------------------------
	ヘッダファイル
-----------------------------------------------------------------------------*/
#include "main.h"
#include "fade.h"
#include "input.h"
#include "sound.h"
#include "title.h"
#include "MeshField.h"
#include "skydome.h"
#include "Shadow.h"
#include "Player.h"
#include "Enemy.h"
#include "EnemyFly.h"
#include "Titlebg.h"

#include "camera.h"

/*-----------------------------------------------------------------------------
	定数定義
-----------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------
	列挙
-----------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------
	構造体
-----------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------
	プロトタイプ宣言
-----------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------
	グローバル変数
-----------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------
 関数名:	void InitTitle( void )
 引数:		なし
 戻り値:	なし
 説明:		初期化
-----------------------------------------------------------------------------*/
void InitTitle( void )
{

	InitCamera();	//	カメラの初期化

	InitMeshField();		//	メッシュフィールドの初期化

	InitSkydome();		//	スカイドームの初期化

	InitShadow();	//	影の初期化

	InitPlayer();		//	プレイヤーの初期化

	InitEnemy();		//	敵の初期化

	InitEnemyFly();		//	敵( 浮遊タイプ )の初期化

	InitTitleBg();		//	タイトルの初期化

	//	音楽再生
	PlaySound( SOUND_LABEL_BGM_TITLE );

}	//	end of func

/*-----------------------------------------------------------------------------
 関数名:	void UninitTitle( void )
 引数:		なし
 戻り値:	なし
 説明:		終了
-----------------------------------------------------------------------------*/
void UninitTitle( void )
{

	UninitMeshField();		//	メッシュフィールドの終了

	UninitSkydome();		//	スカイドームの終了

	UninitShadow();	//	影の終了

	UninitPlayer();	//	プレイヤーの終了

	UninitEnemy();	//	敵の終了

	UninitEnemyFly();	//	敵( 浮遊タイプ )の終了


	UninitTitleBg();		//	タイトルの終了

}	//	end of func

/*-----------------------------------------------------------------------------
 関数名:	void UpdateTitle( void )
 引数:		なし
 戻り値:	なし
 説明:		更新
-----------------------------------------------------------------------------*/
void UpdateTitle( void )
{

	UpdateMeshField();		//	メッシュフィールドの更新

	UpdateSkydome();		//	スカイドームの更新

	UpdateShadow();	//	影の更新

	UpdatePlayer();	//	プレイヤーの更新

	UpdateEnemy();	//	敵の更新

	UpdateEnemyFly();	//	敵( 浮遊タイプ )の更新

	UpdateTitleBg();		//	タイトルの更新


	//	画面遷移
	if( GetKeyboardTrigger( DIK_SPACE ) )
	{

		//	フェードのセット
		SetFade( FADE_OUT , MODE_TUTORIAL );

		//	音楽再生
		PlaySound( SOUND_LABEL_SE_ENTER );

		//	何番目の音を止める
		StopSound( SOUND_LABEL_BGM_TITLE );

	}	//	end of if

}	//	end of func

/*-----------------------------------------------------------------------------
 関数名:	void DrawTitle( void )
 引数:		なし
 戻り値:	なし
 説明:		描画
-----------------------------------------------------------------------------*/
void DrawTitle( void )
{

	DrawMeshField();		//	メッシュフィールドの描画

	DrawSkydome();		//	スカイドームの描画

	DrawShadow();	//	影の描画

	DrawPlayer();		//	プレイヤーの描画

	DrawEnemy();		//	敵の描画

	DrawEnemyFly();		//	敵( 浮遊タイプ )の描画

	DrawTitleBg();		//	タイトルの描画

}	//	end of func
